using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace SmartFridge
{
    public partial class Recipes : Form
    {
        Dictionary<string, int> recipe = new Dictionary<string, int>();
        string doing;
        public Recipes()
        {
            InitializeComponent();
        }

        private void Recipes_Load(object sender, EventArgs e)
        {

        }

        private void btn_recipe1_Click(object sender, EventArgs e)
        {
            recipe.Clear();
            recipe.Add("Πένες", 1);
            recipe.Add("Τυρί κρέμα", 1);
            recipe.Add("Αλάτι", 1);
            recipe.Add("Μουστάρδα", 1);
            recipe.Add("Μέλι", 1);
            recipe.Add("Πιπέρι", 1);
            recipe.Add("Λάδι", 1);
            recipe.Add("Πιπεριά", 2);
            recipe.Add("Αγγούρι", 1);
            recipe.Add("Καλαμπόκι", 2);
            recipe.Add("Τσένταρ", 1);
            recipe.Add("Κρεμμύδι", 1);
            recipe.Add("Ντομάτα", 2);
            recipe.Add("Λεμόνι", 2);

            doing = "Σε μία κατσαρόλα με νερό που βράζει προσθέτουμε αλάτι και τις πένες." +
                    "Βράζουμε για 8 λεπτά." +
                    "Σε ένα μεγάλο μπολ προσθέτουμε το τυρί κρέμα, τη μουστάρδα, το μέλι, πιπέρι, αλάτι το ελαιόλαδο " +
                    "και ανακατεύουμε με ένα κουτάλι." +
                    "Προσθέτουμε ½ κουτάλα με νερό από τα ζυμαρικά και ανακατεύουμε μέχρι να δέσει η σάλτσα." +
                    "Προσθέτουμε την πράσινη πιπεριά ψιλοκομμένη, την κόκκινη πιπεριά σε μικρά κυβάκια, το αγγούρι σε κυβάκια και" +
                    "το πράσινο μέρος από τα φρέσκα κρεμμυδάκια ψιλοκομμένο." +
                    "Βάζουμε το καλαμπόκι, το τσένταρ, τις λιαστές ντομάτες ψιλοκομμένες και τον χυμό από τα lime." +
                    "Σουρώνουμε τις πένες και τις βρέχουμε με κρύο νερό για να κρυώσουν και να σταματήσει ο βρασμός τους." +
                    "Προσθέτουμε στο μπολ με τη σάλτσα τον δυόσμο, τις πένες και ανακατεύουμε καλά." +
                    "Βάζουμε τον δυόσμο, το ελαιόλαδο και σερβίρουμε.";

            ingrediens();
        }

        private void btn_recipe2_Click(object sender, EventArgs e)
        {
            recipe.Clear();
            recipe.Add("Σπαγγέτι", 1);
            recipe.Add("Λάδι", 1);
            recipe.Add("Κρεμμύδι", 2);
            recipe.Add("Λουκάνικο", 1);
            recipe.Add("Σκόρδο", 1);
            recipe.Add("Πιπεριά", 3);
            recipe.Add("Ντομάτα", 1);
            recipe.Add("Ούζο", 1);
            recipe.Add("Ντοματοπελτές", 1);
            recipe.Add("Μέλι", 1);
            recipe.Add("Ελιές", 2);
            recipe.Add("Κάππαρη", 2);
            recipe.Add("Αλάτι", 1);
            recipe.Add("Θυμάρι", 1);
            recipe.Add("Ρίγανη", 1);
            recipe.Add("Φέτα", 1);

            doing = "Βγάζουμε το παγωτό από την κατάψυξη και αφήνουμε σε θερμοκρασία δωματίου για 5-8 λεπτά μέχρι να μαλακώσει." +
        "Το απλώνουμε σε μια λαδόκολλα και το ρολάρουμε μαζί με τη λαδόκολλα έτσι ώστε να αποκτήσει μορφή κυλίνδρου" +
        "και μάκρος περίπου 32 εκ. Σφίγγουμε καλά με τη λαδόκολλα και ξαναβάζουμε στην κατάψυξη. Προθερμαίνουμε τον " +
        "φούρνο στους 180° C στον αέρα. Βάζουμε λαδόκολλα σε ένα ταψί 25x35 εκ. Στον κάδο του μίξερ χτυπάμε με το " +
        "σύρμα τα αυγά και τη ζάχαρη για 4 - 5 λεπτά μέχρι να αφρατέψουν. Προσθέτουμε στον κάδο του μίξερ το αλεύρι," +
        "το κακάο, το μπέικιν πάουντερ, μία πρέζα αλάτι και ομογενοποιούμε ελαφρά με μια πλαστική σπάτουλα. Αδειάζουμε" +
        "το μείγμα στο ταψί και ψήνουμε για 10 - 15 λεπτά. Το βγάζουμε από τον φούρνο και το αφήνουμε να κρυώσει σε μία" +
        "σχάρα για 5 λεπτά. Πασπαλίζουμε μια λαδόκολλα με ζάχαρη άχνη και τοποθετούμε πάνω προσεκτικά το παντεσπάνι " +
        "αφαιρώντας την αρχική λαδόκολλα που το ψήσαμε. Το αφήνουμε να κρυώσει τελείως. Όταν κρυώσει τελείως ρίχνουμε" +
        "τα βύσσινα στο παντεσπάνι. Βγάζουμε από την κατάψυξη το παγωτό και το ξετυλίγουμε. Το τοποθετούμε στην άκρη από" +
        "το παντεσπάνι αφήνοντας ένα κενό 2 εκ. Με την βοήθεια της λαδόκολλας τυλίγουμε το παντεσπάνι γύρω από το" +
        "παγωτό(ρολάροντάς το) μέχρι να το αγκαλιάσει πλήρως. Τυλίγουμε σφιχτά, κλείνουμε καλά τις άκρες και ξανά" +
        "μεταφέρουμε στην κατάψυξη για 2 ώρες. Για να σερβίρουμε βγάζουμε και αφήνουμε σε θερμοκρασία δωματίου για " +
        "5 - 8 λεπτά. Ξετυλίγουμε και περιχύνουμε τη λιωμένη σοκολάτα. ";

            ingrediens();
        }

        private void btn_recipe3_Click(object sender, EventArgs e)
        {
            recipe.Clear();
            recipe.Add("Παγωτό", 1);
            recipe.Add("Αυγά", 4);
            recipe.Add("Ζάχαρη άχνη", 1);
            recipe.Add("Αλέυρι", 1);
            recipe.Add("Κακάο", 1);
            recipe.Add("Μπέικιν πάουντερ", 1);
            recipe.Add("Αλάτι", 1);
            recipe.Add("Βύσσινο", 4);
            recipe.Add("Κουβερτούρα", 1);

            doing = "Στο πολυμηχάνημα με τα μαχαίρια χτυπάμε όλα τα υλικά μέχρι να έχουμε ένα απαλό και λείο μείγμα." +
        "Μεταφέρουμε στο ψυγείο το μείγμα για 15 - 20 λεπτά να σφίξει η μους και στη συνέχεια μεταφέρουμε σε ποτηράκια." +
        "Σερβίρουμε με τη φυτική σαντιγί και τα ψιλοκομμένα φιστίκια.";

            ingrediens();
        }

        private void btn_recipe4_Click(object sender, EventArgs e)
        {
            recipe.Clear();
            recipe.Add("Τυρί κρέμα", 1);
            recipe.Add("Φυστικοβούτυρο", 1);
            recipe.Add("Σιρόπι", 1);
            recipe.Add("Βανίλια", 1);

            doing = "Σε μία κατσαρόλα με νερό που βράζει προσθέτουμε αλάτι και τις πένες." +
        "Βράζουμε για 8 λεπτά. Σε ένα μεγάλο μπολ προσθέτουμε το τυρί κρέμα, τη μουστάρδα, το μέλι, πιπέρι," +
        "αλάτι το ελαιόλαδο και ανακατεύουμε με ένα κουτάλι. Προσθέτουμε ½ κουτάλα με νερό από τα ζυμαρικά " +
        "και ανακατεύουμε μέχρι να δέσει η σάλτσα. Προσθέτουμε την πράσινη πιπεριά ψιλοκομμένη, την κόκκινη" +
        "πιπεριά σε μικρά κυβάκια, το αγγούρι σε κυβάκια και το πράσινο μέρος από τα φρέσκα κρεμμυδάκια ψιλοκομμένο." +
        "Βάζουμε το καλαμπόκι, το τσένταρ, τις λιαστές ντομάτες ψιλοκομμένες και τον χυμό από τα lime." +
        "Σουρώνουμε τις πένες και τις βρέχουμε με κρύο νερό για να κρυώσουν και να σταματήσει ο βρασμός τους." +
        "Προσθέτουμε στο μπολ με τη σάλτσα τον δυόσμο, τις πένες και ανακατεύουμε καλά." +
        "Βάζουμε τον δυόσμο, το ελαιόλαδο και σερβίρουμε.";

            ingrediens();
        }

        private void btn_recipe5_Click(object sender, EventArgs e)
        {
            recipe.Clear();
            recipe.Add("Κοτόπουλο", 1);
            recipe.Add("Αλάτι", 2);
            recipe.Add("Πιπέρι", 1);
            recipe.Add("Κρεμμύδι", 1);
            recipe.Add("Σκόρδο", 1);
            recipe.Add("Μανιτάρια", 3);
            recipe.Add("Φασολάκια", 1);
            recipe.Add("Αλεύρι", 1);
            recipe.Add("Γάλα", 1);
            recipe.Add("Τυρί κρέμα", 1);
            recipe.Add("Γραβιέρα", 1);
            recipe.Add("Γιαούρτι", 2);
            recipe.Add("Τσένταρ", 1);
            recipe.Add("Ρύζι", 1);

            doing = "Κόβουμε το κοτόπουλο σε κομμάτια 2 εκ. και προσθέτουμε αλάτι και πιπέρι."+
                    "Βάζουμε σε ένα μεγάλο τηγάνι που να μπαίνει στον φούρνο το ελαιόλαδο."+
                    "Σοτάρουμε καλά το κοτόπουλο μέχρι να πάρει καλό χρώμα από όλες τις πλευρές."+
                    "Αφαιρούμε από το τηγάνι και προσθέτουμε το κρεμμύδι και το σκόρδο ψιλοκομμένα."+
                    "Στη συνέχεια προσθέτουμε τα μανιτάρια κομμένα σε φέτες και τα φασολάκια κομμένα σε κομμάτια 3 εκ."+
                    "Σοτάρουμε μέχρι να πάρουν όλα ελαφρύ χρώμα."+
                    "Προσθέτουμε το μείγμα του αλευριού και συνεχίζουμε το σοτάρισμα μέχρι να ψηθεί και να μην νιώθουμε τη γεύση του αλευριού."+
                    "Προσθέτουμε πίσω στην κατσαρόλα το κοτόπουλο, τον ζωμό, το γάλα και ανακατεύουμε καλά."+
                    "Προθερμαίνουμε τον φούρνο στο γκριλ στους 220ο C."+
                    "Σιγοβράζουμε το φαγητό για 2 λεπτά μέχρι να πήξει ελαφρώς η σάλτσα."+
                    "Προσθέτουμε το τυρί κρέμα, την τριμμένη γραβιέρα και ανακατεύουμε μέχρι να λιώσουν."+
                    "Ανακατεύουμε με το γιαούρτι και από πάνω πασπαλίζουμε με το τριμμένο τσένταρ."+
                    "Βάζουμε στον φούρνο και ψήνουμε περίπου 10 λεπτά μέχρι το τυρί να πάρει ωραίο χρώμα."+
                    "Το σερβίρουμε σκέτο, με σαλάτα της αρεσκείας μας, λίγο ρύζι ή πλιγούρι.";

            ingrediens();
        }

        private void ingrediens()
        {
            bool haveItAll = true;
            rtb_ingediens.Clear();
            foreach(var ingredien in recipe.Keys)
            {
                if (FridgeSoftware.Shop.existingProducts.ContainsKey(ingredien))
                {
                    rtb_ingediens.Text += ingredien + "\n";
                }
                else
                {
                    rtb_ingediens.Text += ingredien + "(Missing)" + "\n";
                    haveItAll = false;
                }
            }
            if (haveItAll)
            {
                DialogResult dialogResult = MessageBox.Show(doing, "You have all the ingrediens", MessageBoxButtons.OK);
            }
        }

        private void info_Click(object sender, EventArgs e)
        {
            FridgeSoftware.Help.Show(3);
            Help help = new Help();
            help.Show();
        }

        private void btn_GoForShopping_Click(object sender, EventArgs e)
        {
            foreach( var product in recipe.Keys)
            {
                FridgeSoftware.Shop.products.Add(product, recipe[product]);
            }
            FridgeSoftware.Inside.Combine();
        }
    }
}
